doc/html/handlers/security.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Security Handler</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Security Handler"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:24:13 CDT"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Security Handler</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html"><b>Handlers</b></a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Security Handler</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Security Handler</h2>
<div class="outline-text-2" id="text-1">


<p>
  The security handler provides a mechanism for determining whether or not the
  client user has access to a particular resource.  In particular, it can be
  used for injecting HTTP Authentication headers, or for being customized to
  your own app's authentication system, like checking cookies to automatically
  log in a returning user.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Behavior Functions</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-5">
<h5 id="sec-1-1-1"><span class="section-number-5"></span> <code>init(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-1">


<p>
  Initialize the Security Handler.  Like the <a href="./route.html">Route Handler</a>,
  the majority of the work done in the security handler will happen here, or
  at least will start here.
</p>
<p>
  It's typical to check for headers, cookies, or other settings here, and for
  possibly loading paths and their required settings.
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-5">
<h5 id="sec-1-1-2"><span class="section-number-5"></span> <code>finish(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-2">


<p>
  Clean up the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Simplest Example - A security handler that lets everything through</h3>
<div class="outline-text-3" id="text-1-2">


<p>
The default security handler for Nitrogen is extremely simple and allows all
requests through. The text of that handler is here:
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (default_security_handler).
<span class="org-preprocessor">-behaviour</span> (security_handler).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>
]).


<span class="org-function-name">init</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">By default, let all requests through. If we wanted to impose</span>
    <span class="org-comment-delimiter">% </span><span class="org-comment">security, then check the page module (via wf:page_module()),</span>
    <span class="org-comment-delimiter">% </span><span class="org-comment">and if the user doesn't have access, then set a new page module and path info,</span>
    <span class="org-comment-delimiter">% </span><span class="org-comment">via wf_context:page_module(Module), wf_context:path_info(PathInfo).</span>
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> Cookie-based Authentication Example</h3>
<div class="outline-text-3" id="text-1-3">


<p>
As an example, you could automatically log in a user based on a cookie inside
the security handler. This example assumes you'll check an authentication
cookie stored with your login table within a database, providing a <code>db_login</code>
module for interacting with the user table. It assumes the existance of a 
<code>db_login:loginid_from_cookie/1</code> function which takes an a <code>Cookie</code> and returns
a <code>Loginid</code> or <code>undefined</code>.
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (bracketpal_security_handler).
<span class="org-preprocessor">-behaviour</span> (security_handler).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>
]).


<span class="org-function-name">init</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-type">attempt_cookie_login</span>(),
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-comment-delimiter">%% </span><span class="org-comment">PRIVATE FUNCTIONS %%</span>

<span class="org-comment-delimiter">%% </span><span class="org-comment">First, let's check to see if we've already tried to log in this user using</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">cookies. If we have, then we don't want to keep trying, and hitting the</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">database every time we load a page when we already know that it won't</span>
<span class="org-comment-delimiter">%% </span><span class="org-comment">authenticate</span>

<span class="org-function-name">attempt_cookie_login</span>() -&gt;
    <span class="org-type">attempt_cookie_login</span>(session).

<span class="org-function-name">attempt_cookie_login</span>(session) -&gt;
    <span class="org-comment-delimiter">%% </span><span class="org-comment">Have we already attempted a cookie login?</span>
    <span class="org-comment-delimiter">%% </span><span class="org-comment">If so, then skip it</span>
    <span class="org-comment-delimiter">%% </span><span class="org-comment">If not, let's try to authenticate with the cookie</span>
    <span class="org-keyword">case</span> <span class="org-type">wf</span>:<span class="org-type">session_default</span>(cookie_login_attempted,false) <span class="org-keyword">of</span>
        false -&gt;<span class="org-function-name"> </span><span class="org-type">attempt_cookie_login</span>(cookie);
        <span class="org-variable-name">_</span> -&gt;<span class="org-function-name"> </span>do_nothing
    <span class="org-keyword">end</span>;
<span class="org-function-name">attempt_cookie_login</span>(cookie) -&gt;
    <span class="org-comment-delimiter">%% </span><span class="org-comment">Let's read the authentication token from our "quicklogin" cookie</span>
    <span class="org-keyword">case</span> <span class="org-type">wf</span>:<span class="org-type">cookie</span>(quicklogin) <span class="org-keyword">of</span>
        undefined -&gt;
            <span class="org-comment-delimiter">%% </span><span class="org-comment">The cookie is undefined, so obviously there's nothing to log in</span>
            do_nothing;
        <span class="org-variable-name">Cookie</span> -&gt;
            <span class="org-comment-delimiter">%% </span><span class="org-comment">Let's check our database to see if we have a user that's</span>
            <span class="org-comment-delimiter">%% </span><span class="org-comment">associated with our authentication cookie</span>
            <span class="org-keyword">case</span> <span class="org-type">db_login</span>:<span class="org-type">loginid_from_cookie</span>(<span class="org-variable-name">Cookie</span>) <span class="org-keyword">of</span>
                undefined -&gt;<span class="org-function-name"> </span>
                  <span class="org-comment-delimiter">%% </span><span class="org-comment">No user associated with that token, so let's just do nothing</span>
                  do_nothing;
                <span class="org-variable-name">Loginid</span> -&gt;<span class="org-function-name"> </span>
                  <span class="org-comment-delimiter">%% </span><span class="org-comment">Yes! We have a login associated with that cookie, so let's</span>
                  <span class="org-comment-delimiter">%% </span><span class="org-comment">Set use the Nitrogen user handler to set the loginid</span>
                  <span class="org-type">wf</span>:<span class="org-type">user</span>(<span class="org-variable-name">Loginid</span>)
            <span class="org-keyword">end</span>,

            <span class="org-comment-delimiter">%% </span><span class="org-comment">Finally, we've now attempted to do a cookie login, so let's set</span>
            <span class="org-comment-delimiter">%% </span><span class="org-comment">a session variable so we don't try doing the cookie login again</span>
            <span class="org-comment-delimiter">%% </span><span class="org-comment">for this session</span>
            <span class="org-type">wf</span>:<span class="org-type">session</span>(cookie_login_attempted,true)
    <span class="org-keyword">end</span>.
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3"></span> An HTTP Auth Example</h3>
<div class="outline-text-3" id="text-1-4">


<p>
Nitrogen also provides a simple HTTP Auth security handler for those interested
in employing some HTTP auth-type user verification (courtesy of Torbjorn Tornkvist).
</p>
<p>
The full text of this can be viewed on <a href="https://github.com/nitrogen/nitrogen_core/blob/master/src/handlers/security/http_basic_auth_security_handler.erl">Github</a>
</p>

</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-5">


<ul>
<li><a href="../handlers.html">Handler Overview</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:24:13 CDT</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/handlers/security.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
